Revit 2027 API
BuiltInFailures.FabricFailures.FabricSheetWrongHost Property
 Fabric Sheet can be placed only in Structural Floors and straight Structural Walls.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricSheetWrongHost { get; }
Public Shared ReadOnly Property FabricSheetWrongHost As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricSheetWrongHost {
	FailureDefinitionId^ get ();
}
static member FabricSheetWrongHost : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FabricFailures Class
Autodesk.Revit.DB Namespace